08_Rails/tickets/app/controllers/tickets_controller.rb

  def create
    @ticket = Ticket.new(ticket_params)

    respond_to do |format|
      if @ticket.save
---
INSERT INTO "tickets" ("title", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Teste 01"], ["price", 123.0], ["created_at", "2022-03-30 19:20:33.086175"], ["updated_at", "2022-03-30 19:20:33.086175"]]

  def update
    respond_to do |format|
      if @ticket.update(ticket_params)
---
UPDATE "tickets" SET "price" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["price", 12.3], ["updated_at", "2022-03-30 19:20:46.372660"], ["id", 1]]